Repo/Sample_stacking/1_100_2_sample_stacking/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
5000
(
(3.33013333e-05 0 1.57628768e-05)
(3.33013333e-05 0 4.73075379e-05)
(3.33013333e-05 -3.64195022e-23 7.88900365e-05)
(3.33013333e-05 -7.68692605e-23 0.000110510418)
(3.33013333e-05 -7.67821e-23 0.000142168728)
(3.33013333e-05 1.12983805e-22 0.000173865012)
(3.33013333e-05 7.66080921e-23 0.000205599315)
(3.33013333e-05 0 0.000237371683)
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
5000
(
(4.9952e-05 0 1.57628768e-05)
(4.9952e-05 0 4.73075379e-05)
(4.9952e-05 0 7.88900365e-05)
(4.9952e-05 0 0.000110510418)
(4.9952e-05 0 0.000142168728)
(4.9952e-05 0 0.000173865012)
(4.9952e-05 0 0.000205599315)
(4.9952e-05 0 0.000237371683)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (3.33013333e-05 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (3.33013333e-05 0 1);
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
